app/views/products/index.html.erb

<script type="text/javascript" charset="utf-8">
$(function() {
  $(".js-more").on("click", function() {
    var id = $(this).data("id");
    $.get("/products/" + id + ".json", function(data) {
        debugger;
        var inventoryText = "<strong>Available</strong>";
        if(data["inventory"] === ""){
          inventoryText = "<strong>Sold Out</strong>";
        var descriptionText = "<p>" + data["description"] + "</p><p>" + inventoryText + "</p>";
        $("#product-" + id).html(descriptionText);
        jQuery.each(data["orders"],function(i,order){
          $("product-orders-"+id).append('<li>'+order.id+"-"+order.created_at+'</li>');
        });
    });
  });
});
---
SELECT "products".* FROM "products"